use std::error::Error;
use teloxide::{
    payloads::SendMessageSetters,
    prelude::Requester,
    types::{CallbackQuery, Me},
    utils::command::BotCommands,
    Bot,
};

use super::options::{self, GetKeybard, Ruqyah, Start};

pub async fn handler(
    bot: Bot,
    q: CallbackQuery,
    me: Me,
) -> Result<(), Box<dyn Error + Send + Sync>> {
    if let Some(ref text) = q.data {
        bot.answer_callback_query(&q.id).await?;
        let chat_id = q.regular_message().unwrap().chat.id;

        match BotCommands::parse(text, me.username()) {
            Ok(options::Start::Ruqyah) => {
                bot
                    .send_message(chat_id, "اختر الرقية الذي تبحث عنها:")
                    .reply_markup(Ruqyah::keyboards())
                    .await?;
            }
            Ok(options::Start::AboutRuqyah) => {
                bot
                .send_message(
                    chat_id, 
                    "عن الرقية الشرعية:\n\nتعتبر الرقية الشرعية وسيلة مقبولة ومؤثرة لطلب العلاج والاستشفاء من الأمراض، وهي معتمدة على القرآن الكريم والأذكار النبوية للعلاج من الأمراض الروحية والجسدية والحماية من الشرور والسحر والعين، وتعتبر الرقية الشرعية طريقة مباحة شرعًا، وتعتمد على قوة الإيمان والتوكل على الله.\n\nوالرقية مشروعة في أصلها بأمر النبي ﷺ وفعله، والأفضل للمسلم أن يرقي نفسه؛ كما كان النبي ﷺ يرقي نفسه، ففي الصحيحين عن عائشة (رضي الله عنها) قالت: كان رسول الله ﷺ إذا اشتكى يقرأ على نفسه بالمعوذات وينفث، فلما اشتد وجعه كنت أقرأ عليه وأمسح بيده رجاء بركتها. وهذه الرقى الشرعية تتضمن آيات من القرآن الكريم وأدعية مأثورة عن النبي ﷺ.\n\nحكم الرقية الشرعية:\n\nجائزة بشرط أن تكون بالقرآن الكريم، أو بالسنة النبوية، أو بأسماء الله الحسنى وصفاته، أو بالدعاء الشرعي، مع التوكل على الله، والأخذ بالأسباب، والاعتقاد بأن الله وحده الضار والنافع؛ قال النبي ﷺ: (لا بأس بالرقى ما لم يكن فيه شرك)، وقبل البدء في الرقية الشرعية لا بد من:\n\n- التوبة من الآثام والذنوب.\n- مراقبة الله والحرص على الطاعات وأداء الصلاة في وقتها.\n- التوكل على الله والاعتماد عليه والاعتقاد الجازم بأن القرآن شفاء ورحمة مع استحضار نية الاستشفاء وتدبر معاني القرآن.\n- المواظبة على قراءة الرقية وعدم الالتفات إلى وسوسة الشيطان في إضعاف الهمة عن إكمالها.\n\nفضل الرقية الشرعية:\n\nللرقية الشرعية فضل عظيم لذا أوصى النبي أمته بها، ومن أهم فضائلها:\n\n- منحة من الله لعباده فيها شفاء لهم.\n- الرقية الشرعية مخرج من مصائب الدنيا والآخرة.\n- الرقية تحمي وتحفظ من السحر.\n- الرقية تعالج وتحمي من الحسد.\n- الرقية الشرعية تساعد في شفاء الأمراض والوقاية منها.\n\nولذلك يجب أن نحافظ على الرقية الشرعيّة من وقت لآخر، ففيها حفظ للإنسان من الشر والأذى بإذنه تعالى، وتساعد في الوقاية والعلاج من المرض الناتج عن الحسد وغيره.")
                .reply_markup(Start::keyboards())
                .await?;
            }
            Ok(options::Start::AboutBot) => {
                bot.send_message(
                    chat_id,
                    "تم تصميمه لكي يكون طريقة سهلة للمسلم للتعلم عن الرقية الشرعية",
                )
                .reply_markup(Start::keyboards())
                .await?;
            }

            Err(_) => {}
        }

        match BotCommands::parse(text, me.username()) {
            Ok(options::Ruqyah::RuqyahFromTheHolyQuran) => {
                bot.send_message(
                    chat_id,
                    "الرقية الشرعية من القرآن الكريم:\n\nالرقية الشرعية من القرآن الكريم هي مجموعة من الآيات التي وردت في كتاب الله، والتي ورد فيها جواز واستحباب الرقية بنية الشفاء، ومنها:\n\nتلاوة سورة الفاتحة والإخلاص والمعوذتين:\n\n- {الحمد لله رب العالمين الرحمن الرحيم مالك يوم الدين إياك نعبد وإياك نستعين اهدنا الصراط المستقيم صراط الذين أنعمت عليهم غير المغضوب عليهم ولا الضالين}.\n- {قل هو الله أحد الله الصمد لم يلد ولم يولد ولم يكن له كفوًا أحد}.\n- {قل أعوذ برب الفلق من شر ما خلق ومن شر غاسق إذا وقب ومن شر النفاثات في العقد ومن شر حاسد إذا حسد}.\n- {قل أعوذ برب الناس ملك الناس إله الناس من شر الوسواس الخناس الذي يوسوس في صدور الناس من الجنة والناس}.\n\nآيات سورة البقرة لطرد الشياطين: هذه الآيات تحصن الإنسان من السحر والحسد وتعالج منه أيضًا، وهي:\n\n- {واتبعوا ما تتلو الشياطين على ملك سليمان وما كفر سليمان ولكن الشياطين كفروا يعلمون الناس السحر وما أنزل على الملكين ببابل هاروت وماروت وما يعلمان من أحد حتى يقولا إنما نحن فتنة فلا تكفر فيتعلمون منهما ما يفرقون به بين المرء وزوجه وما هم بضارين به من أحد إلا بإذن الله ويتعلمون ما يضرهم ولا ينفعهم ولقد علموا لمن اشتراه ما له في الآخرة من خلاق ولبئس ما شروا به أنفسهم لو كانوا يعلمون}\n\nآيات من سورة آل عمران: في سورة آل عمران توجد آيات تستخدم ضمن الرقية الشرعية بنية طلب الحفظ والحماية، وهي:\n\n- {قل اللهم مالك الملك تؤتي الملك من تشاء وتنزع الملك ممن تشاء وتعز من تشاء وتذل من تشاء بيدك الخير إنك على كل شيء قدير تولج الليل في النهار وتولج النهار في الليل وتخرج الحي من الميت وتخرج الميت من الحي وترزق من تشاء بغير حساب}.\n\nآيات من سورة يونس: هناك آية في سورة يونس يجب أن تتضمنها الرقية الشرعية، وهي:\n\n- {وإن يمسسك الله بضر فلا كاشف له إلا هو وإن يردك بخير فلا راد لفضله يصيب به من يشاء من عباده وهو الغفور الرحيم}.\n\nآيات من سورة الإسراء: وردت في سورة الإسراء آيات يمكن أن تتضمنها الرقية الشرعية، ومنها قوله تعالى:\n\n- {وقل رب أدخلني مدخل صدق وأخرجني مخرج صدق واجعل لي من لدنك سلطانًا نصيرًا وقل جاء الحق وزهق الباطل إن الباطل كان زهوقًا وننزل من القرآن ما هو شفاء ورحمة للمؤمنين ولا يزيد الظالمين إلا خسارا}.\n",
                )
                .reply_markup(Ruqyah::keyboards())
                .await?;
            }
            Ok(options::Ruqyah::RuqyahFromTheNoblePropheticSunnah) => {
                bot.send_message(chat_id, "الرقية الشرعية من السنة النبوية الشريفة\n\nكان للنبي ﷺ أدعية مميزة جدًا تستخدم في الرقية الشرعية للتحصين والحفظ والحماية والشفاء أيضًا، ومن أبرز هذه الأدعية:\n\n- (أذهب الباس رب الناس، اشفِ وأنت الشافي، لا شفاء إلا شفاؤك، شفاء لا يغادر سقمًا). [رواه البخاري]\n\n- (أعوذ بكلمات الله التامة، من كل شيطان وهامة، ومن كل عين لامة). [رواه البخاري]\n\n- (أعوذ بكلمات الله التامات من شر ما خلق). [صححه الألباني]\n\n- (بسم الله الذي لا يضرّ مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم). [صححه الألباني]\n\n- (باسم الله أرقيك، من كل شيء يؤذيك، من شر كل نفس، أو عين حاسد، الله يشفيك باسم الله أرقيك). [رواه مسلم]\n\n- (باسم الله يبريك، ومن كل داء يشفيك، ومن شر حاسد إذا حسد، وشر كل ذي عين). [رواه مسلم]\n\n- (بسم الله أعوذ بعزة الله، وقدرته من شر ما أجد، وأحاذر). [صححه الألباني]\n\n- (أعوذ بكلمات الله التامات التي لا يجاوزهن بر ولا فاجر، من شر ما خلق وذرأ وبرأ، ومن شر ما ينزل من السماء، ومن شر ما يعرج فيها، ومن شر ما ذرأ في الأرض، ومن شر ما يخرج منها، ومن شر فتن الليل والنهار، ومن شر كل طارق إلا طارقًا يطرق بخير يا رحمن). [صححه الألباني]\n\n- (اللهم إني أعوذ بك من الشيطان الرجيم وهمزه ونفخه ونفثه). [ صححه الألباني]\n\n- (باسم الله، تربة أرضنا، بريقة بعضنا، يشفى سقيمنا، بإذن ربنا). [رواه البخاري]\n\n- (اللهم فاطر السماوات والأرض، عالم الغيب والشهادة، لا إله إلا أنت، رب كل شيء ومليكه، أعوذ بك من شر نفسي، ومن شر الشيطان وشركه، وأن أقترف على نفسي سوءًا، أو أجره إلى مسلم).[صححه الألباني]\n\n- (اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت). [صححه الألباني]")
                .reply_markup(Ruqyah::keyboards())
                .await?;
            }
            Ok(options::Ruqyah::VideoSheikhWahidBali) => {
                bot.send_message(chat_id, "علاج العين والحسد للشيخ وحيد بالي ويحاوره د.علي النمر\n\nرابط الفيديو:\nhttps://youtu.be/mu3iESTwauw?si=N8nhsh0N69Qz_pjs")
                .reply_markup(Ruqyah::keyboards())
                .await?;
            }
            Ok(options::Ruqyah::RuqyahForTheLoverDemon) => {
                bot.send_message(chat_id, "رقية المس العاشق\n\nللشيخ عبدالله الخليفة\n\nhttps://youtu.be/MBZLK_2Ozls?si=2tDCNXSu7otrFj2S")
                .reply_markup(Ruqyah::keyboards())
                .await?;
            }
            Ok(options::Ruqyah::RuqyahForKids) => {
                bot.send_message(chat_id, "طريقة رقية الاطفال :\n\nوضع اليد على الطفل و قراءة ما يلي\n\n⭐️فاتحة الكتاب ( ثلاث مرات ) :\n\n- بسم الله الرحمن الرحيم  الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ * الرَّحْمَنِ الرَّحِيمِ * مَالِكِ يَوْمِ الدِّينِ * إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ * اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ * صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلا الضَّالِّينَ \n\n-  لم * ذَلِكَ الْكِتَابُ لا رَيْبَ فِيهِ هُدًى لِلْمُتَّقِينَ * الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَ يُقِيمُونَ الصَّلاة وَمِمَّا رَزَقْنَاهُمْيُنفِقُونَ * وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنْزِلَ إِلَيْكَ وَمَا أُنْزِلَ مِنْ قَبْلِكَ وَبِالآخرَةِ هُمْ يُوقِنُونَ * أُوْلَئِكَ عَلَى هُدًى مِنْ رَبِّهِمْ وَأُوْلَئِكَ هُمْ الْمُفْلِحُونَ \n\n- اللَّهُ لا إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ وَلا نَوْمٌ لَهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَ مَا خَلْفَهُمْ وَلا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ \n\nالمعوذتان والاخلاص\n\nمع قراءة الأدعية التالية :\n\n-  بسم الله أرقيك من كلّ شيء يؤذيك، أعوذ بكلمات الله التامّة من كل شيطان وهامّة، ومن كل عين لامّه  ( ثلاث مرات).\n\n-  عوذ بكلمات الله التامات التي لا يجاوزهن برّ ولا فاجر من شر ما خلق ، و برأ و ذرأ و من شر ما ينزل من المساء، و من شر ما يعرج فيها ، و من شرّ ما يخرج من الأرض، و من شر ما يكمن فيها  ومن شر فتن الليل و النهار ، و من شر كلّ طارق إلا طارق يطرق بخير ، يا رحمن يا رحيم  ( ثلاث مرات).\n\n- اللهم ربّ الناس أذهب البأس و اشف أنت الشافي ، لا شفاء إلاّ شفاؤك شفاءً لا يُغادر سقماً  ( ثلاث مرات).\n\n- بسم الله أرقيك من كلّ شرّ يؤذيك ، و من شرّ كل نفس و عين كلّ حاسد الله يشفيك “(ثلاث مرات).\n\n- اللهم اذهب حرّ العين و بردها و وصبها  ( ثلاث مرات).\n\nوفي الاخير تقوم بالمسح على جسم الطفل\nان كان الطفل يستطيع شرب الماء تعطيه ماء مرقي مقروء عليه نفس الايات\nودهنه بزيت الزيتون المرقي")
                .reply_markup(Ruqyah::keyboards())
                .await?;
            }
            Ok(options::Ruqyah::PrayerToBreakTheSpell) => {
                bot.send_message(chat_id, "اللهم مالك الملك تؤتي الملك من تشاء وتنزع الملك ممن تشاء وتعز من تشاء وتذل من تشاء.. بيدك الخير إنك علىٰ كل شيء قدير.. 'تولج الليل في النهار وتولج النهار في الليل، وتخرج الحي من الميت، وتخرج الميت من الحي، وترزق من تشاء بغير حساب'.\n\nأعوذ بالله السميع العليم من الشيطان الرجيم.. بسم الله الرحمن الرحيم، بسم الله أصبحنا وأمسينا بالله الذي ليس منه شيء ممتنع.. وبعزة الله التي لا ترام ولا تضام، وبسلطان الله المنيع نحتجب، وبأسمائه الحسنى كلها عائذا من شياطين الإنس والجن، ومن شر كل معلن أو مس، ومن شر ما يسرح بالليل ويكمن بالنهار، ومن شر ما يسرح بالنهار ويكمن بالليل، ومن شر ما خلق وذرأ وبرأ، ومن شر إبليس وجنوده، ومن شر كل شيء أنت آخذ بناصيتها، إن ربي على صراط مستقيم.\n\nأعوذ بكلمات الله التامات من شر ما خلق وذرأ وبرأ، ومن شر ما ينزل من السماء ومن شر ما يعرج فيها، ومن شر ما يلج في الأرض، ومن شر ماي خرج منها، ومن شر طوارق الليل والنهار، ومن شر كل طارق يطرق إلا طارقاً يطرق بخير يا رحمن.\n\nالحمد لله رب العالمين اللهم لك الحمد كله دقه وجله علانيته وسره اللهم لك الحمد يا من توحّدت بالملك والملكوت وتفرّدت بالعظمة والجبروت ملكت فقهرت وخلقت فأمرت لاتحول ولا تزول لاتغيب ولاتفوت قائم بنفسك سبحانك أنت الواحد العظيم في جلاله وقدسه القادر العليم بأحوال جنه وإنسه الكبير المتعال العالم بكل حال سبحانك أنت المتكبر ذو الجلال والإكرام نحمدك سبحانك بحمد الأنبياء والأولياء والصالحين والملآئكة المقربين اللهم إنّا نحمدك بما تحب أن تسمع من عبادك حمداً اللهم نحمدك حمداً كثيراً اللهم صل وسلم وبارك على عبدك ونبيك محمدٍ وعلى آله وأصحابه الطيبين الطاهرين اللهم أنت أكبر كبيراً .اللهم أنت أكبر كبيراً اللهم لك الحمد كثيراً اللهم إنا نسبحك بكرة وأصيلاً اللهم أنت العالم بكل حال اللهم منزّل الكتاب ومجريَ السحاب هازم الأحزاب شديد العقاب سريع الحساب اللهم احصِ السحرة وأعوانهم عدداً\n\nاللهم منزّل الكتاب ومجريَ السحاب هازم الأحزاب شديد العقاب سريع الحساب اللهم احصِ السحرة وأعوانهم عدداً\n\nاللهم احصِ السحرة وأعوانهم عدداً\n\nاللهم واقتلهم بدداً\n\nاللهم ولا تغادر منهم أحداً\n\nاللهم قتّل السحرة وأعوانهم أجمعين\n\nاللهم إنّا نجعلك في نحورهم\n\nاللهم إنّا نعوذ بك من شرورهم اللهم إنّا نعوذ بك من اسحارهم وعقدهم وربطهم ياقوي يا متين\n\nاللهم إنّا ونعوذ بك من اسحارهم وعقدهم وربطهم\n\nاللهم أنزل عليهم بأسك الشديد اللهم أنزل عليهم بأسك الشديد اللهم أنزل عليهم بأسك الشديدالذي لايُردُ ولا يُصدُ ولا يقدر على دفعه أحد\n\nاللهم أهلك أقواهم اللهم أهلك أعتاهم اللهم أهلك أمكرهم وأكبرهم اللهم هلك أمكرهم وأكبرهم وأدهاهم وأخفاهم\n\nاللهم اهلك أعلمهم بالسحر وأشدّهم وأقواهم سحراً\n\nاللهم اهلك كل جبار عنيد اللهم اهلك كل جبار عنيد اللهم اهلك كل جبار عنيد شيطان متكبر مريد\n\nاللهم اهلك من تسلطو بالسحر على عبادك عددا اللهم اقتلهم بدد فانهم لا يعجزونك\n\nاللهم عليك بكل ملك ساحر من الجان بسحره المستمر تسلط\n\nاللهم إنا نجعلك في نحروهم ونعوذ بك من شرِّورهم إكفناهم بما شئت وكيف شئت\n\nاللهم اهلك من تسلّطوا بالسحر على عبادك عدداً، اللهم واقتلهم بدداً ، ولا تغادر منهم أحداً ، فإنهم لا يعجزونك ،\n\nاللهم وأهلكهم هلاك عادٍ وثمود\n\nاللهم اجعل عاليهم سافلهم كقوم لوط\n\nاللهم وأرجمهم بحجارة اللهم وأرجمهم بحجارة اللهم وأرجمهم بحجارة اللهم وأرجمهم بحجارة من سجيل منضود مسومة من عندك من الشياطين غير بعيد\n\nاللهم وأرسل عليهم ريحاً صرصراً\n\nاللهم أرسل عليهم ريحاً صرصراً في يوم نحسٍ مستمر\n\nاللهم اجعلهم كأعجاز نخلٍ منقعر\n\nاللهم أهلكهم بالطاغية\n\nاللهم لا تجعل لهم من باقية\n\nاللهم سلط عليهم جنداً من جندك\n\nوملائكةً من عندك\n\nاللهم أنزل عليهم رجزك الأليم\n\nوعذابك الشديد\n\nاللهم سلط عليهم جنداً من جندك وملائكة من عندك يسومونهم سوء العذاب\n\nيضربون وجوههم وأدبارهم ، وأذقهم عذاب الحريق،.")
                .reply_markup(Ruqyah::keyboards())
                .await?;
            }
            Ok(options::Ruqyah::Back1) => {
                bot.send_message(chat_id, "الاختيارات الرئيسية:")
                    .reply_markup(Start::keyboards())
                    .await?;
            }

            Err(_) => {}
        }
    }

    Ok(())
}
